IMMZEK/msp-project/vasa/makedir/__programmer/deskdb/content/TICloudAgent/linux/ccs_base/common/targetdb/Modules/AM263/CONTROLSS_G0_EPWM5_CONTROLSS_G0_EPWM5.xml
	<register id="CONTROLSS_G0_EPWM5_ETSEL" acronym="CONTROLSS_G0_EPWM5_ETSEL" offset="0x148" width="16" description="Event Trigger Selection Register">
		<bitfield id="SOCBEN" width="1" begin="15" end="15" resetval="0x0" description="Enable the ADC Start of Conversion B [EPWMxSOCB] Pulse   0: Disable EPWMxSOCB.  1: Enable EPWMxSOCB pulse." range="15" rwaccess="R/W"/> 
		<bitfield id="SOCBSEL" width="3" begin="14" end="12" resetval="0x0" description="EPWMxSOCB Selection Options  These bits determine when a EPWMxSOCB pulse will be generated.   000: Enable DCBEVT1.soc event  001: Enable event time-base counter equal to zero. [TBCTR = 0x00]  010: Enable event time-base counter equal to period [TBCTR = TBPRD]  011: Enable event time-base counter based on mixed events [ETSOCBMIX].  ETSOCBMIX is configured in the ETSOCBMIXEN register.   100: Enable event time-base counter equal to CMPA when the timer is incrementing or CMPC when the timer is incrementing  101: Enable event time-base counter equal to CMPA when the timer is decrementing or CMPC when the timer is decrementing  110: Enable event: time-base counter equal to CMPB when the timer is incrementing or CMPD when the timer is incrementing  111: Enable event: time-base counter equal to CMPB when the timer is decrementing or CMPD when the timer is decrementing [*] Event selected is determined by SOCBSELCMP bit." range="14 - 12" rwaccess="R/W"/> 
		<bitfield id="SOCAEN" width="1" begin="11" end="11" resetval="0x0" description="Enable the ADC Start of Conversion A [EPWMxSOCA] Pulse   0: Disable EPWMxSOCA.  1: Enable EPWMxSOCA pulse." range="11" rwaccess="R/W"/> 
		<bitfield id="SOCASEL" width="3" begin="10" end="8" resetval="0x0" description="EPWMxSOCA Selection Options  These bits determine when a EPWMxSOCA pulse will be generated.   000: Enable DCAEVT1.soc event  001: Enable event time-base counter equal to zero. [TBCTR = 0x00]  010: Enable event time-base counter equal to period [TBCTR = TBPRD]  011: Enable event time-base counter based on mixed events [ETSOCAMIX].  ETSOCAMIX is configured in the ETSOCAMIXEN register.   100: Enable event time-base counter equal to CMPA when the timer is incrementing or CMPC when the timer is incrementing  101: Enable event time-base counter equal to CMPA when the timer is decrementing or CMPC when the timer is decrementing  110: Enable event: time-base counter equal to CMPB when the timer is incrementing or CMPD when the timer is incrementing  111: Enable event: time-base counter equal to CMPB when the timer is decrementing or CMPD when the timer is decrementing [*] Event selected is determined by SOCASELCMP bit." range="10 - 8" rwaccess="R/W"/> 
		<bitfield id="INTSELCMP" width="1" begin="6" end="6" resetval="0x0" description="EPWMxINT Compare Register Selection Options   0: Enable event time-base counter equal to CMPA when the timer is incrementing / Enable event time-base counter equal to CMPA when the timer is decrementing / Enable event: time-base counter equal to CMPB when the timer is incrementing / Enable event: time-base counter equal to CMPB when the timer is decrementing to INTSEL selection mux.  1: Enable event time-base counter equal to CMPC when the timer is incrementing / Enable event time-base counter equal to CMPC when the timer is decrementing / Enable event: time-base counter equal to CMPD when the timer is incrementing / Enable event: time-base counter equal to CMPD when the timer is decrementing to INTSEL selection mux." range="6" rwaccess="R/W"/> 
		<bitfield id="SOCBSELCMP" width="1" begin="5" end="5" resetval="0x0" description="EPWMxSOCB Compare Register Selection Options   0: Enable event time-base counter equal to CMPA when the timer is incrementing / Enable event time-base counter equal to CMPA when the timer is decrementing / Enable event: time-base counter equal to CMPB when the timer is incrementing / Enable event: time-base counter equal to CMPB when the timer is decrementing to SOCBSEL selection mux.  1: Enable event time-base counter equal to CMPC when the timer is incrementing / Enable event time-base counter equal to CMPC when the timer is decrementing / Enable event: time-base counter equal to CMPD when the timer is incrementing / Enable event: time-base counter equal to CMPD when the timer is decrementing to SOCBSEL selection mux." range="5" rwaccess="R/W"/> 
		<bitfield id="SOCASELCMP" width="1" begin="4" end="4" resetval="0x0" description="EPWMxSOCA Compare Register Selection Options   0: Enable event time-base counter equal to CMPA when the timer is incrementing / Enable event time-base counter equal to CMPA when the timer is decrementing / Enable event: time-base counter equal to CMPB when the timer is incrementing / Enable event: time-base counter equal to CMPB when the timer is decrementing to SOCASEL selection mux.  1: Enable event time-base counter equal to CMPC when the timer is incrementing / Enable event time-base counter equal to CMPC when the timer is decrementing / Enable event: time-base counter equal to CMPD when the timer is incrementing / Enable event: time-base counter equal to CMPD when the timer is decrementing to SOCASEL selection mux." range="4" rwaccess="R/W"/> 
		<bitfield id="INTEN" width="1" begin="3" end="3" resetval="0x0" description="Enable ePWM Interrupt [EPWMx_INT] Generation   0: Disable EPWMx_INT generation  1: Enable EPWMx_INT generation" range="3" rwaccess="R/W"/> 
		<bitfield id="INTSEL" width="3" begin="2" end="0" resetval="0x0" description="ePWM Interrupt [EPWMx_INT] Selection Options   000: Reserved  001: Enable event time-base counter equal to zero. [TBCTR = 0x00]  010: Enable event time-base counter equal to period [TBCTR = TBPRD]  011: Enable event time-base counter based on mixed events [ETINTMIX].  ETINTMIX is configured in the ETINTMIXEN register.   100: Enable event time-base counter equal to CMPA when the timer is incrementing or CMPC when the timer is incrementing  101: Enable event time-base counter equal to CMPA when the timer is decrementing or CMPC when the timer is decrementing  110: Enable event: time-base counter equal to CMPB when the timer is incrementing or CMPD when the timer is incrementing  111: Enable event: time-base counter equal to CMPB when the timer is decrementing or CMPD when the timer is decrementing [*] Event selected is determined by INTSELCMP bit." range="2 - 0" rwaccess="R/W"/>
	</register>
